Documents/ИнвентаризацияОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ИнвентаризацияОС</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснованиеВид</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснованиеНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснованиеДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаИнвентаризации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияИнвентаризации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаПроведенияИнвентаризации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОС</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОсновноеСредство</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтоимостьПоДаннымУчета</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаличиеПоДаннымУчета</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПоДаннымУчета</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтоимостьФактическая</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаличиеФактическое</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоФактическое</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтоимостьПоРезультатамИнвентаризации</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтоимостьПоУчетуЗаЕдиницу</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИнвентаризационнаяКомиссия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Председатель</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ИнвентаризацияОС/Forms/ФормаСтрокиМобильныйКлиент/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДобавляетсяНоваяСтрока = Параметры.НоваяСтрока;
	ДлинаИнвентарногоНомера = ПолучитьДлинуКодаСправочникаОС();
	
	Если ДобавляетсяНоваяСтрока Тогда
		Организация = Параметры.Организация;
		Дата = Параметры.Дата;
		Заголовок = НСтр("ru='Выберите ОС или отсканируйте штрихкод'");
		Элементы.ОсновноеСредство.ТолькоПросмотр = Ложь;
	Иначе
		Заголовок = Параметры.ИнвентарныйНомер;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры,
		"ОсновноеСредство,ИнвентарныйНомер,КоличествоПоДаннымУчета,КоличествоФактическое,Местонахождение,МОЛ");
	
	ИнвентарноеОС = ЭтоИнвентарноеОС(ОсновноеСредство);
	
	Если КоличествоПоДаннымУчета <> 0 И КоличествоФактическое = КоличествоПоДаннымУчета Тогда
		ВНаличии = Истина;
	КонецЕсли;
	
	Комментарий = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОсновноеСредство, "Комментарий", Истина);
	
	УправлениеВидимостью(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураВозврата = Новый Структура("ОсновноеСредство, КоличествоФактическое, МОЛ, Местонахождение,
		|КоличествоПоДаннымУчета, ИнвентарныйНомер",
		ОсновноеСредство, КоличествоФактическое, МОЛ, Местонахождение,
		КоличествоПоДаннымУчета, ИнвентарныйНомер);
	
	Если КомментарийИзменен Тогда
		ИзменитьКомментарийОС(ОсновноеСредство, Комментарий);
	КонецЕсли;
	
	ОповеститьОВыборе(СтруктураВозврата);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ВНаличииПриИзменении(Элемент)
	
	Если ВНаличии Тогда
		КоличествоФактическое = 1;
		Элементы.СканироватьШтрихкодОС.Видимость = Ложь;
		Элементы.ЗакрытьПослеСканирования.Видимость = Истина;
	Иначе
		КоличествоФактическое = 0;
		Элементы.СканироватьШтрихкодОС.Видимость = Истина;
		Элементы.ЗакрытьПослеСканирования.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоФактуПриИзменении(Элемент)
	
	Элементы.ЗакрытьПослеСканирования.Видимость = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновноеСредствоПриИзменении(Элемент)
	
	СведенияДляЗаполнения = СведенияОбОсновномСредстве(ОсновноеСредство, Организация, Дата);
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, СведенияДляЗаполнения);
	
	Заголовок = СведенияДляЗаполнения.ИнвентарныйНомер;
	
	УправлениеВидимостью(ЭтотОбъект)
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийПриИзменении(Элемент)
	
	КомментарийИзменен = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СканироватьШтрихкодОС(Команда)
	
	Штрихкод = "";
	
	ВводШтрихкода = Новый ОписаниеОповещения("ВводШтрихкодаЗавершение", ЭтаФорма);
	
	Если МобильныйКлиентБПКлиент.ЭтоМобильныйКлиент()
		И МобильныйКлиентБПКлиент.ДоступноСканированиеШтрихкодов() Тогда
		МобильныйКлиентБПКлиент.НачатьСканированиеШтрихКодов("Отсканируйте штрихкод с этикетки основного средства", ВводШтрихкода);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьПослеСканирования(Команда)
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеВидимостью(Форма)
	
	Элементы = Форма.Элементы;
	
	Если Форма.ИнвентарноеОС Тогда
		Элементы.ВНаличии.Видимость = Истина;
		Элементы.МОЛ.Видимость = Истина;
		Элементы.ПоУчету.Видимость = Ложь;
		Элементы.ПоФакту.Видимость = Ложь;
		Если Форма.ВНаличии Тогда
			Элементы.СканироватьШтрихкодОС.Видимость = Ложь;
		Иначе
			Элементы.СканироватьШтрихкодОС.Видимость = Истина;
		КонецЕсли;
	Иначе
		Элементы.ВНаличии.Видимость = Ложь;
		Элементы.ПоУчету.Видимость = Истина;
		Элементы.ПоФакту.Видимость = Истина;
		Элементы.МОЛ.Видимость = Ложь;
	КонецЕсли;
	
	Если Форма.ВНаличии Тогда
		Элементы.ЗакрытьПослеСканирования.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ИзменитьКомментарийОС(ОсновноеСредство, Знач Комментарий)
	
	Если ЗначениеЗаполнено(Комментарий) Тогда
		ОбъектОС = ОсновноеСредство.ПолучитьОбъект();
		
		Попытка
			ОбъектОС.Заблокировать();
			
			ОбъектОС.Комментарий = Комментарий;
			
			ОбъектОС.Записать();
		Исключение
			ЗаписьЖурналаРегистрации("БлокировкаОСИнвентаризацияМК", УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
			ОбщегоНазначения.СообщитьПользователю(Нстр("ru = 'Не удалось установить комментарий для основного средства. Подробности в журнале регистрации.'"));
			
			Возврат;
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВводШтрихкодаЗавершение(Штрихкод, ДополнительныеПараметры) Экспорт
	
	Если Не Штрихкод = Неопределено Тогда
		ЭтоШтрихкод = УчетОСКлиент.ЭтоШтрихкодОС(Штрихкод);
		
		Если ЭтоШтрихкод Тогда
			Штрихкод = Лев(Штрихкод, 12);
			ЧастьКодаОС = Прав(Штрихкод, 6);
		ИначеЕсли СтрДлина(Штрихкод) = ДлинаИнвентарногоНомера И СтрНайти(Штрихкод, "-") > 0 Тогда
			ЧастьКодаОС = Штрихкод;
		Иначе
			ПоказатьПредупреждение(,"Штрихкод не является инвентарным номером основного средства", ,"Проверка штрихкода");
			Возврат;
		КонецЕсли;
		ДобавитьПоКодуОСНаСервере(ЧастьКодаОС, ЭтоШтрихкод);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДлинуКодаСправочникаОС()
	
	Возврат Метаданные.Справочники.ОсновныеСредства.ДлинаКода;
	
КонецФункции

&НаКлиенте
Процедура ДобавитьПоКодуОСНаСервере(КодОС, ЭтоШтрихкод = Ложь)
	
	ОС = ПолучитьОСПочастиКода(КодОС, ЭтоШтрихкод);
	
	Если ОС <> ОсновноеСредство Тогда
		ТекстСообщения = Нстр("ru = 'Штрихкод принадлежит другому основному средству. Проверьте этикетку.'");
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		
		Возврат;
	КонецЕсли;
	
	Если ДобавляетсяНоваяСтрока Тогда
		СведенияОС = СведенияОбОсновномСредстве(ОС, Организация, Дата);
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, СведенияОС);
	КонецЕсли;
	
	КоличествоФактическое = КоличествоФактическое + 1;
	
	Если ИнвентарноеОС И КоличествоФактическое > 1 Тогда
		КоличествоФактическое = 1;
		
		Возврат;
	КонецЕсли;
	
	Если КоличествоФактическое = КоличествоПоДаннымУчета Тогда
		ВНаличии = Истина;
	КонецЕсли;
	
	УправлениеВидимостью(ЭтотОбъект);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьОСПоЧастиКода(ЧастьКодаОС, ЭтоШтрихкод)
	
	ОсновноеСредство = Справочники.ОсновныеСредства.ПустаяСсылка();
	
	Если НЕ ЭтоШтрихкод Тогда
		ОсновноеСредство = Справочники.ОсновныеСредства.НайтиПоКоду(ЧастьКодаОС);
		
		Возврат ОсновноеСредство;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОсновныеСредства.Ссылка КАК ОсновноеСредство
	|ИЗ
	|	Справочник.ОсновныеСредства КАК ОсновныеСредства
	|ГДЕ
	|	ПОДСТРОКА(ОсновныеСредства.Код, 4, 6) = &ЧастьКодаОС";
	
	Запрос.УстановитьПараметр("ЧастьКодаОС",ЧастьКодаОС);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ОсновноеСредство = Выборка.ОсновноеСредство;
	КонецЕсли;
	
	Возврат ОсновноеСредство;
	
КонецФункции

&НаСервереБезКонтекста
Функция СведенияОбОсновномСредстве(ОсновноеСредство, Организация, Дата)
	
	Результат = Новый Структура("ИнвентарноеОС, ИнвентарныйНомер, КоличествоПоДаннымУчета,
		|Местонахождение, МОЛ, Комментарий");
	
	Результат.ИнвентарноеОС = ЭтоИнвентарноеОС(ОсновноеСредство);
	
	СведенияОбИнвентарномНомере = УчетОС.СведенияОбИнвентарномНомереОС(ОсновноеСредство, Организация, Дата);
	
	Результат.ИнвентарныйНомер = СведенияОбИнвентарномНомере.ИнвентарныйНомер;
	
	ПараметрыЗапросаОстатков = Новый Структура("Организация, Дата, ПодразделениеОрганизации, ОтветственноеЛицо",
		Организация, Дата, Справочники.ПодразделенияОрганизаций.ПустаяСсылка(), Справочники.ФизическиеЛица.ПустаяСсылка());
	
	МассивОС = Новый Массив;
	МассивОС.Добавить(ОсновноеСредство);
	
	ТаблицаОС = Документы.ИнвентаризацияОС.ОстаткиОС(ПараметрыЗапросаОстатков, МассивОС);
	
	Если ТаблицаОС.Количество() = 1 Тогда
		Для каждого СтрокаОС Из ТаблицаОС Цикл
			Результат.Местонахождение = СтрокаОС.Местонахождение;
			Результат.МОЛ = СтрокаОС.МОЛ;
			Результат.КоличествоПоДаннымУчета = СтрокаОС.КоличествоПоУчету;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция ЭтоИнвентарноеОС(ОсновноеСредство)
	
	ИнвентарноеОС = Ложь;
	Если ОсновноеСредство.ЕдиницаУчета = Перечисления.ЕдиницыУчетаОС.ИнвентарныйОбъект Тогда
		ИнвентарноеОС = Истина;
	КонецЕсли;
	
	Возврат ИнвентарноеОС;
	
КонецФункции

#КонецОбласти
